#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/initialised-si/JoWe-Web-Dev/runs/run-VA1KXh6ZP5eHiK3d

Waiting for the plan to start...

Terraform v1.5.3
on linux_amd64
Initializing plugins and modules...
module.web.aws_cloudfront_origin_access_identity.jowe_web: Refreshing state... [id=E2WK19VXEQOQCH]
module.web.aws_s3_bucket.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_public_access_block.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_ownership_controls.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_s3_bucket_versioning.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refreshing...
module.web.data.aws_iam_policy_document.jowe_web_s3_policy: Refresh complete after 0s [id=3228599042]
module.web.aws_s3_bucket_policy.jowe_web: Refreshing state... [id=jowe-dev.initialised.si]
module.web.aws_cloudfront_distribution.jowe_web: Refreshing state... [id=E36U11KHAWUB2P]
module.web.aws_s3_bucket_acl.jowe_web: Refreshing state... [id=jowe-dev.initialised.si,private]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css.map"]: Refreshing state... [id=static/css/main.dce9ee63.css.map]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js.map"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js.map]
module.web.aws_s3_object.upload_webapp["manifest.json"]: Refreshing state... [id=manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js.LICENSE.txt"]: Refreshing state... [id=static/js/373.f0584962.chunk.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js.map"]: Refreshing state... [id=static/js/373.f0584962.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css"]: Refreshing state... [id=static/css/106.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/924.eae530bc.chunk.js.map"]: Refreshing state... [id=static/js/924.eae530bc.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/726.23200c89.chunk.js.map"]: Refreshing state... [id=static/js/726.23200c89.chunk.js.map]
module.web.aws_s3_object.upload_webapp["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js"]: Refreshing state... [id=static/js/698.1c688865.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.map"]: Refreshing state... [id=static/js/main.83bd2d10.js.map]
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js.map"]: Refreshing state... [id=static/js/106.66034d11.chunk.js.map]
module.web.aws_s3_object.upload_webapp["asset-manifest.json"]: Refreshing state... [id=asset-manifest.json]
module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js"]: Refreshing state... [id=static/js/106.66034d11.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/106.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/106.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js"]: Refreshing state... [id=static/js/777.4dc86836.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js"]: Refreshing state... [id=static/js/main.83bd2d10.js]
module.web.aws_s3_object.upload_webapp["static/js/496.c9f3cc61.chunk.js"]: Refreshing state... [id=static/js/496.c9f3cc61.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/924.eae530bc.chunk.js"]: Refreshing state... [id=static/js/924.eae530bc.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/726.23200c89.chunk.js"]: Refreshing state... [id=static/js/726.23200c89.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/463.ffa5fc90.chunk.css.map"]: Refreshing state... [id=static/css/463.ffa5fc90.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/css/main.dce9ee63.css"]: Refreshing state... [id=static/css/main.dce9ee63.css]
module.web.aws_s3_object.upload_webapp["static/css/463.ffa5fc90.chunk.css"]: Refreshing state... [id=static/css/463.ffa5fc90.chunk.css]
module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js"]: Refreshing state... [id=static/js/373.f0584962.chunk.js]
module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js.map"]: Refreshing state... [id=static/js/463.9981da85.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/698.1c688865.chunk.js.map"]: Refreshing state... [id=static/js/698.1c688865.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js.map"]: Refreshing state... [id=static/js/777.4dc86836.chunk.js.map]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css.map"]: Refreshing state... [id=static/css/777.872b5878.chunk.css.map]
module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js"]: Refreshing state... [id=static/js/463.9981da85.chunk.js]
module.web.aws_s3_object.upload_webapp["static/css/777.872b5878.chunk.css"]: Refreshing state... [id=static/css/777.872b5878.chunk.css]
module.web.aws_s3_object.upload_webapp["index.html"]: Refreshing state... [id=index.html]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg"]: Refreshing state... [id=static/media/anonymous-male.a323776dc6f4f8a3ceb8.jpg]
module.web.aws_s3_object.upload_webapp["static/media/anonymous-female.9d832d02f50e90f40bbe.jpg"]: Refreshing state... [id=static/media/anonymous-female.9d832d02f50e90f40bbe.jpg]
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.LICENSE.txt"]: Refreshing state... [id=static/js/main.83bd2d10.js.LICENSE.txt]
module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.map"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.LICENSE.txt"]: Drift detected (update)
module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js.map"]: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.web.aws_s3_object.upload_webapp["asset-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "df40ce84425eef06ca376d1593d8cabb" -> "3e87fc7d4c0dc95632ec1939af405835"
        id                     = "asset-manifest.json"
        tags                   = {}
      ~ version_id             = "kga_8VQPR.HAu2g9rZ39izsJDloBqkVX" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "upload_webapp" {
      ~ etag                   = "85be4e7c139cc26b9b5c65bd6f2602b3" -> "b23aa0727b579575d27a973f1362f1d3"
        id                     = "index.html"
        tags                   = {}
      ~ version_id             = "oAUVrzWdu52OTdzU4BtKJEcxtcRJlFnA" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/2.f730c837.chunk.css"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css; charset=utf-8"
      + etag                   = "82cbf7fb7a1e950d8be1567a50041ff1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/2.f730c837.chunk.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/2.f730c837.chunk.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/2.f730c837.chunk.css.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "09b2e136d156edb4f00f0a93a85abfe4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/css/2.f730c837.chunk.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/css/2.f730c837.chunk.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/css/463.ffa5fc90.chunk.css"] will be destroyed
  # (because key ["static/css/463.ffa5fc90.chunk.css"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css; charset=utf-8" -> null
      - etag                   = "20120204e50d287252d4e9c7f377394e" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/463.ffa5fc90.chunk.css" -> null
      - key                    = "static/css/463.ffa5fc90.chunk.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/463.ffa5fc90.chunk.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "HJIa0nrJYvz.EcRwacdd1FM2zzRqPRjT" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/css/463.ffa5fc90.chunk.css.map"] will be destroyed
  # (because key ["static/css/463.ffa5fc90.chunk.css.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "5bf5713184ab8ddae626cf52903d6de8" -> null
      - force_destroy          = false -> null
      - id                     = "static/css/463.ffa5fc90.chunk.css.map" -> null
      - key                    = "static/css/463.ffa5fc90.chunk.css.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/css/463.ffa5fc90.chunk.css.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "FfY0BcWlwrO08H7GmDC1gSS8AKQrjymS" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js"] will be destroyed
  # (because key ["static/js/106.66034d11.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "71665b060b1287fe58e606960ee05cfd" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/106.66034d11.chunk.js" -> null
      - key                    = "static/js/106.66034d11.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/106.66034d11.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Im7jd7O_3XcQJT12HbAqmy4j_Oq.o0d2" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.66034d11.chunk.js.map"] will be destroyed
  # (because key ["static/js/106.66034d11.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "9f26c56b79a305cbfafcd6f10d0d56c2" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/106.66034d11.chunk.js.map" -> null
      - key                    = "static/js/106.66034d11.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/106.66034d11.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "8GEDulTCYeqv3tuGc3XIRcl9PLUGt7BW" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "cab4d1f68fc74701f989cb7e03d73fc0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/106.8390d3bf.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/106.8390d3bf.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/106.8390d3bf.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "82a0a3b0641b357325c3be250381f136"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/106.8390d3bf.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/106.8390d3bf.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/2.ee71faef.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "200f754f1f2fb8a441dd019236e086d7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/2.ee71faef.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/2.ee71faef.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/2.ee71faef.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "6048b20062287797faf9100a51dc47f4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/2.ee71faef.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/2.ee71faef.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js"] will be destroyed
  # (because key ["static/js/373.f0584962.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "bd9b2c858984125ab188ec839d50db57" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/373.f0584962.chunk.js" -> null
      - key                    = "static/js/373.f0584962.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/373.f0584962.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "SmaZ0XLHCWRi73IZkiSl4.0qzwAfE9tK" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/373.f0584962.chunk.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "686f404fb6748c84bd90802c573b89fc" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/373.f0584962.chunk.js.LICENSE.txt" -> null
      - key                    = "static/js/373.f0584962.chunk.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/373.f0584962.chunk.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "u2GUXQpCrc8irb920znE_3oFSAzlqP.W" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/373.f0584962.chunk.js.map"] will be destroyed
  # (because key ["static/js/373.f0584962.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "e79b4a1b2da3f11b90f57bf8eb5d1ae3" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/373.f0584962.chunk.js.map" -> null
      - key                    = "static/js/373.f0584962.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/373.f0584962.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "pN5.Kt2ttX.g59JI3Cjxh1Rj1WXqVURC" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js"] will be destroyed
  # (because key ["static/js/463.9981da85.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "08a6c37794ca4ddf320e17e5471f8933" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/463.9981da85.chunk.js" -> null
      - key                    = "static/js/463.9981da85.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/463.9981da85.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "v.w.HxSkx3B8yzUTFuSHrVDOC7HOycCU" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/463.9981da85.chunk.js.map"] will be destroyed
  # (because key ["static/js/463.9981da85.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "6f885c2bf9aedc74eb75e143e5395189" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/463.9981da85.chunk.js.map" -> null
      - key                    = "static/js/463.9981da85.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/463.9981da85.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "2Skxq5e.dbnf3Iz7jnwbFQy_7tQCvKEi" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "5d278ff08a7051b876a7dc5670cb8d8b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/719.a25f1e9e.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/719.a25f1e9e.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "686f404fb6748c84bd90802c573b89fc"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/719.a25f1e9e.chunk.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/719.a25f1e9e.chunk.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/719.a25f1e9e.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "a3f3e2e77bb99fb1db1c90397194ba3f"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/719.a25f1e9e.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/719.a25f1e9e.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.23200c89.chunk.js"] will be destroyed
  # (because key ["static/js/726.23200c89.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "f7f4a89c45799de2c8a1e3ca42336212" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/726.23200c89.chunk.js" -> null
      - key                    = "static/js/726.23200c89.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/726.23200c89.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "GYYuVEAnDOjOJRV8g0r7IWD8gG6AwnnT" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.23200c89.chunk.js.map"] will be destroyed
  # (because key ["static/js/726.23200c89.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "78045a17e8156112aa93d4dea2a68ae9" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/726.23200c89.chunk.js.map" -> null
      - key                    = "static/js/726.23200c89.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/726.23200c89.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "LTuzSAqs2cf3gN0Li9vIk6DpsxbFuARv" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "62971b18f8cb874477df910dfe941b21"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/726.51f7dd57.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/726.51f7dd57.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/726.51f7dd57.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "ee1fedb75063543d92e96e801966f13d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/726.51f7dd57.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/726.51f7dd57.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "965239adf343cd95304e520396eb780d"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/777.107dea8d.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/777.107dea8d.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.107dea8d.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "223c05ae41a78dad89ccfd1d528bc8e8"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/777.107dea8d.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/777.107dea8d.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js"] will be destroyed
  # (because key ["static/js/777.4dc86836.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "300d9f5fadc14ba25203c675dd493c73" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/777.4dc86836.chunk.js" -> null
      - key                    = "static/js/777.4dc86836.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/777.4dc86836.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "s0ID_5cnv6KCHuk_5nAy2ciI6C_HnOIU" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/777.4dc86836.chunk.js.map"] will be destroyed
  # (because key ["static/js/777.4dc86836.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "0c0c0e30a1e7498fb640a5e363e41555" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/777.4dc86836.chunk.js.map" -> null
      - key                    = "static/js/777.4dc86836.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/777.4dc86836.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "0jAUBZLbKlsM94F2hmkAh35BJmsKPcjz" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "6a4a570635a3d501a332e130f08183f7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.16f99540.chunk.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.16f99540.chunk.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.16f99540.chunk.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "66537a7ec11fd7d9dbec1cc57872be87"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/924.16f99540.chunk.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/924.16f99540.chunk.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.eae530bc.chunk.js"] will be destroyed
  # (because key ["static/js/924.eae530bc.chunk.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "fb3285e9d59e908413dc9bd29538b467" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/924.eae530bc.chunk.js" -> null
      - key                    = "static/js/924.eae530bc.chunk.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/924.eae530bc.chunk.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "BIdadeqlxIs8lx3PtnTBgd1l2l3e8Okq" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/924.eae530bc.chunk.js.map"] will be destroyed
  # (because key ["static/js/924.eae530bc.chunk.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "39ea10e0d5fe2e4ae59f443892c0c0f0" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/924.eae530bc.chunk.js.map" -> null
      - key                    = "static/js/924.eae530bc.chunk.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/924.eae530bc.chunk.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "Jt5JtJcy6pjJGTVYJeEWil9o0YdI95ss" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js"] will be destroyed
  # (because key ["static/js/main.83bd2d10.js"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/javascript" -> null
      - etag                   = "2b8e48f9093a3ccade6cad7fc422e61a" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83bd2d10.js" -> null
      - key                    = "static/js/main.83bd2d10.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83bd2d10.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "1P7OrEo4ieWXPNBZIodjwIWSngnhg_0f" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/main.83bd2d10.js.LICENSE.txt"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/plain; charset=utf-8" -> null
      - etag                   = "ad1529f76e3e9c44d0f3385f7571ad68" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83bd2d10.js.LICENSE.txt" -> null
      - key                    = "static/js/main.83bd2d10.js.LICENSE.txt" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83bd2d10.js.LICENSE.txt" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "S7.hcI375SuJJA25Se68RKtvCcIjLiPC" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.83bd2d10.js.map"] will be destroyed
  # (because key ["static/js/main.83bd2d10.js.map"] is not in for_each map)
  - resource "aws_s3_object" "upload_webapp" {
      - bucket                 = "jowe-dev.initialised.si" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "fcb954ab6ad67f9509f6dfdc06be5e00" -> null
      - force_destroy          = false -> null
      - id                     = "static/js/main.83bd2d10.js.map" -> null
      - key                    = "static/js/main.83bd2d10.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "./build//static/js/main.83bd2d10.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - version_id             = "chcfM8BQfbgwTJVyO2GlB8yBSjl3iY6U" -> null
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.c25b44c6.js"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "88ea863d7dd7e75602e64b1f90140ae1"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.c25b44c6.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.c25b44c6.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.c25b44c6.js.LICENSE.txt"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/plain; charset=utf-8"
      + etag                   = "ad1529f76e3e9c44d0f3385f7571ad68"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.c25b44c6.js.LICENSE.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.c25b44c6.js.LICENSE.txt"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.web.aws_s3_object.upload_webapp["static/js/main.c25b44c6.js.map"] will be created
  + resource "aws_s3_object" "upload_webapp" {
      + acl                    = (known after apply)
      + bucket                 = "jowe-dev.initialised.si"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "374e53e446fdc82d06b848dee023aa1c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "static/js/main.c25b44c6.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = "AES256"
      + source                 = "./build//static/js/main.c25b44c6.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 18 to add, 2 to change, 18 to destroy.

------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 37 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @Andrej988, Action: `pull_request`*